{
  "A.G.G. Liu": "A.G.G. Liu explores history's oddities and scientific curiosities with equal parts rigor and playfulness—from Mongolian Buddhism to Olympic trivia to whether tides work the way you think they do. Expect deep dives into forgotten facts, irreverent takes on space exploration, and the occasional ranking of video games by their spreadsheet requirements.",
  "Abram Demski": "Abram Demski explores the foundations of intelligence and computation through an unusually rigorous lens, connecting abstract questions in epistemology and mathematics to practical problems in AI alignment. His work ranges from technical investigations of lambda calculus and computationalism to philosophical puzzles about consciousness and meaning, often challenging conventional boundaries between these domains with creative analogies and formal precision.",
  "Adrià Garriga Alonso": "Adrià Garriga Alonso explores the technical foundations of machine learning and AI safety, from policy gradients and mechanistic interpretability to the economics of GPU dominance. He balances deep dives into programming paradigms (memory-safe C, Rust translation tradeoffs) with broader questions about how cultural norms shape AI development and deployment, all while maintaining a skeptical eye on statistical reasoning and research methodology.",
  "Alex Altair": "Alex Altair explores the intersection of abstract mathematics, AI safety, and lived experience with a distinctly personal touch. Their writing moves fluidly between technical agent foundations research, philosophical puzzles about identity and culture, and intimate observations about memory, walks, and coffee—all with the curiosity of someone who sees deep questions in both Turing machines and everyday moments.",
  "Amanda Luce": "Amanda Luce explores the messy intersections of neurodivergence, social norms, and self-improvement with unflinching honesty. She writes personal essays that question popular assumptions—about weight loss drugs, relationship structures, and \"luxury beliefs\"—while sharing practical wisdom on everything from cleaning habits to understanding your own broken parts. Her work is introspective, occasionally contrarian, and deeply human.",
  "Angadh Nanjangud": "Angadh Nanjangud explores the uncanny ways technology reshapes human behavior—from dating apps mimicking arranged marriages to self-driving cars as moral philosophers. His writing weaves sharp cultural observation with philosophical inquiry, examining how modern tools quietly rewire our psychology, relationships, and sense of self, often revealing uncomfortable truths about what we're becoming in the process."
}