{
  "A.G.G. Liu": "A.G.G. Liu explores history's oddities and scientific curiosities with equal parts rigor and playfulness—from Mongolian Buddhism to Olympic trivia to whether tides work the way you think they do. Expect deep dives into forgotten facts, irreverent takes on space exploration, and the occasional ranking of video games by their spreadsheet requirements.",
  "Abram Demski": "Abram Demski explores the foundations of intelligence and computation through an unusually rigorous lens, connecting abstract questions in epistemology and mathematics to practical problems in AI alignment. His work ranges from technical investigations of lambda calculus and computationalism to philosophical puzzles about consciousness and meaning, often challenging conventional boundaries between these domains with creative analogies and formal precision.",
  "Adrià Garriga Alonso": "Adrià Garriga Alonso explores the technical foundations of machine learning and AI safety, from policy gradients and mechanistic interpretability to the economics of GPU dominance. He balances deep dives into programming paradigms (memory-safe C, Rust translation tradeoffs) with broader questions about how cultural norms shape AI development and deployment, all while maintaining a skeptical eye on statistical reasoning and research methodology.",
  "Alex Altair": "Alex Altair explores the intersection of abstract mathematics, AI safety, and lived experience with a distinctly personal touch. Their writing moves fluidly between technical agent foundations research, philosophical puzzles about identity and culture, and intimate observations about memory, walks, and coffee—all with the curiosity of someone who sees deep questions in both Turing machines and everyday moments.",
  "Amanda Luce": "Amanda Luce explores the messy intersections of neurodivergence, social norms, and self-improvement with unflinching honesty. She writes personal essays that question popular assumptions—about weight loss drugs, relationship structures, and \"luxury beliefs\"—while sharing practical wisdom on everything from cleaning habits to understanding your own broken parts. Her work is introspective, occasionally contrarian, and deeply human.",
  "Angadh Nanjangud": "Angadh Nanjangud explores the uncanny ways technology reshapes human behavior—from dating apps mimicking arranged marriages to self-driving cars as moral philosophers. His writing weaves sharp cultural observation with philosophical inquiry, examining how modern tools quietly rewire our psychology, relationships, and sense of self, often revealing uncomfortable truths about what we're becoming in the process.",
  "Ben Goldhaber": "Ben Goldhaber explores AI's impact on knowledge, truth, and society at pivotal moments in history, mixing technical deep-dives on systems like Gemini and Claude with philosophical questions about epistemics at scale. His writing ranges from pragmatic life advice (\"You Can Just Buy Things\") to personal reflections and cultural observations, all threaded with concerns about navigating transformative technological change wisely.",
  "Ben Pace": "Ben Pace explores the art of thinking clearly and living deliberately, mixing sharp analysis of rationalist culture with candid personal reflections. He dissects everything from the quirks of online intellectual communities to his own formative experiences, blending self-aware humor with earnest inquiry into how we can build better mental models and break free from our default patterns.",
  "Ben Steinhorn": "Ben Steinhorn explores the intimate architecture of memory—how we preserve, organize, and make meaning from what we inherit and experience. His writing moves fluidly between the personal and philosophical, examining grief, libraries, rationality, and the artifacts of cultural memory with equal curiosity. He's drawn to questions of how we know what we know and why we keep what we keep.",
  "Camille Berger": "Camille Berger explores the boundaries of language, thought, and human connection through a distinctively philosophical lens—from constructed languages like Esperanto and Ithkuil to the nature of conversation itself. With posts ranging from fiery takes on analytic philosophy to personal reflections on bitterness, the writing blends rationalist rigor with poetic mysticism and unapologetic intensity.",
  "Claire Wang": "Claire Wang explores the messy, urgent questions of being human—from perfectionism and self-perception to mortality and meaning. Through personal essays tinged with rationalist thinking and psychological insight, she examines why we feel the way we do and how we might live better, occasionally pausing for poetry or recommendations along the way.",
  "Croissanthology": "Croissanthology explores rationality, utopian thinking, and the contradictions of being human in a world of automation and AI. With a mix of philosophical rigor and self-aware humor (see: clone therapy), they tackle questions about authenticity, cooperation, and whether we should outsource our discussions about the future—all while maintaining a refreshingly personal and experimental voice.",
  "Daniel Paleka": "Daniel Paleka explores the technical frontiers of AI and reinforcement learning while wrestling with AI safety concerns from a researcher's perspective. Between deep dives into how ML systems actually work and fail, he shares contrarian takes on everything from immortality tradeoffs to personal productivity—blending rigorous technical thinking with unexpectedly practical life philosophy.",
  "Daniel Reeves": "Daniel Reeves explores the intersection of technology, productivity, and clear thinking—from combating AI-generated schmaltz and navigating internet rabbit holes to building better writing tools and habits. His posts blend technical insights with rationalist philosophy and practical life advice, often focusing on how we can structure our digital lives and thought processes more intentionally.",
  "David Gros": "David Gros explores the intersection of large language models, knowledge graphs, and data analysis through hands-on technical experiments. His work spans from using Wikidata to evaluate and interpret LLMs to quirky geospatial analyses of street names across America. With a focus on practical development notes and reproducible research, he documents both cutting-edge ML interpretability techniques and playful data-driven investigations.",
  "Eneasz Brodski": "Eneasz Brodski explores the intersection of speculative fiction and philosophical inquiry, examining how science fiction and fantasy illuminate questions of morality, consciousness, and human nature. Through a blend of literary criticism, personal reflection, and irreverent philosophical musings, he treats genre fiction as a lens for understanding reality—arguing that imaginative worlds reveal deeper truths about existence.",
  "Harri Besceli": "Harri Besceli explores the intersection of philosophy and practical reasoning, examining how identity shapes our choices and how we justify them to ourselves. Through case studies like FTX's collapse and reflections on promises, lies, and fictional heroes like Aragorn, the writing questions how we construct meaning and navigate moral complexity in an increasingly rationalized world.",
  "Hauke Hillebrandt": "Hauke Hillebrandt explores the intersection of economics, geopolitics, and societal change—from the origins of the Industrial Revolution to contemporary great power competition with China. His writing blends historical analysis with forward-looking questions about global conflict, public policy efficiency, and economic impact, all examined through a rationalist lens that connects past patterns to present risks.",
  "Human Invariant": "Human Invariant explores the mechanics and market design of prediction markets, diving deep into their interfaces, pricing dynamics, and path to mainstream adoption. Beyond forecasting platforms, they examine rationality, agency, and how systems shape behavior—from the hidden costs of \"just doing things\" to the economics of blame. Technical yet accessible analysis for builders and thinkers optimizing decision-making infrastructure.",
  "Jenn": "Jenn explores the collision points between personal experience and larger cultural forces—from Asian diaspora identity and generational shifts to AI's impact on creativity, public health policy, and demographic trends. Her writing moves fluidly between intimate memoir (grief, family, fandom) and sharp societal analysis, examining how we connect, create, and govern in an increasingly complex world.",
  "Joanna Bregan": "Joanna Bregan explores the intimate mechanics of building a meaningful life—from the psychology of flying with toddlers to death meditations that crack open spiritual experience. She writes with unflinching honesty about motherhood, marriage, creative protection, and the hard choices required to live deliberately. Her work blends practical wisdom with philosophical depth, always rooted in personal revelation.",
  "Justin Kuiper": "Justin Kuiper blends literary criticism with moral philosophy, often through a satirical lens inspired by C.S. Lewis's Screwtape Letters. He examines the intersection of culture, technology, and ethics—from the economics of YouTube to the spiritual pitfalls facing creators. His writing combines humor with serious philosophical inquiry, tackling everything from Weird Al's boundaries to the moral implications of modern media.",
  "Justin Miller": "Justin Miller explores the collision points between AI safety, rationality, and deeply personal memoir—examining how abstract philosophical questions about corrigibility and existential risk intersect with individual memory, family history, and the small human moments that resist systematization. His writing moves fluidly between technical AI concerns and intimate reflection, always questioning the frameworks we use to understand both machines and ourselves.",
  "Justis Mills": "Justis Mills explores the intersection of rational thinking and everyday life, from statistical oddities like quaternions and world quintiles to candid takes on personal sustainability and social media norms. With a mix of technical curiosity and philosophical skepticism, the writing challenges conventional wisdom while wrestling with questions of how to live deliberately in an age of information overload.",
  "Kave Rennedy": "Kave Rennedy explores rationality and philosophy through imaginative metaphors—from blood magic to wisps—while questioning societal assumptions about resource allocation, evolutionary dynamics, and existential risk. Their work blends speculative fiction aesthetics with rigorous thinking about how we reason, where power comes from, and why our collective decisions often miss the mark.",
  "Linch Zhang": "Linch Zhang explores how we think, know, and reason our way through life's biggest questions—from the nature of aging and AI safety to the unexpected virtues of middlemen and continental philosophy. With a rationalist lens and self-aware humor, he tackles everything from humanity's hardest problems to which books actually changed his mind (versus the ones he wishes had).",
  "Lucie Philippon": "Lucie Philippon chronicles her adventures building AI safety communities (often at breakneck speed in places like Lyon), while navigating the rationalist diaspora's recurring question: to live in the Bay Area or not? She blends practical posts on ultra-light travel and relationship communication with deeper dives into rationality, commitment devices, and geopolitical commentary on France's future.",
  "Lydia Nottingham": "Lydia Nottingham explores the intersection of technical rigor and intentional living, moving fluidly between machine learning theory (probabilistic models, causal inference), mathematical optimization problems, and practical wisdom about career development and personal growth. Her work blends AI safety research with reflections on how to build expertise, time decisions strategically, and design a meaningful intellectual life.",
  "Mahmoud Ghanem": "Mahmoud Ghanem explores the intersections of analytic philosophy, consciousness, and computational theory, with particular interest in classical debates about knowledge, meaning, and mind. His work bridges historical philosophical figures like Nietzsche and Foucault with contemporary problems in epistemology and philosophy of mind, often examining how logical frameworks and cybernetic concepts illuminate questions about agency, qualia, and human flourishing.",
  "Margarita Lovelace": "Margarita Lovelace explores the peculiar wisdom hidden in everyday relationships—from treating partners like cats to texting the right guy at the bar. She blends archetypal psychology (Magician, Warrior, King, Lover) with intensely personal experiments in pole dancing, solar mythology, and emotional survival, offering life advice that's equal parts mystical framework and playfully unhinged personal essay.",
  "Markus Strasser": "Markus Strasser explores the frontier of human-AI interaction, from meta-prompts as software primitives to interfaces that adapt alongside their users. His work spans the technical depth of training generative models to practical experiments in chat UIs and semantic editing, with a throughline of making AI systems more tasteful, responsive, and aligned with creative human needs.",
  "Michael Dayah": "Michael Dayah explores the intersection of philosophy and lived experience, examining how we perceive reality, make choices, and construct meaning. His writing blends epistemology with cultural observation—from Plato's Cave to AI interfaces to video game mechanics—using contemporary touchstones to probe timeless questions about knowledge, ethics, and how our paradigms shape what we see as possible.",
  "Michael Dickens": "Michael Dickens explores rationality, epistemology, and philosophy through an eclectic mix of rigorous analysis and playful speculation. He tackles questions ranging from AI alignment and effective altruism to whether Groot maintains personal identity and why NCIS's two-person keyboard scene actually makes sense. His writing balances technical depth with humor, unafraid to pursue both profound implications and delightfully absurd tangents.",
  "Mikhail Samin": "Mikhail Samin explores the absurdities of modern life through a lens that mixes sharp social observation with speculative thinking. His writing zigzags from satirizing London social scenes to examining AI safety concerns, from historical pranks to philosophical thought experiments about prediction markets and unicorns. The through-line is a playful yet incisive curiosity about how society works—and how it might work differently.",
  "Nikola Jurkovic": "Nikola Jurkovic explores the thorniest questions in AI safety—from takeover scenarios and persuasion risks to the timeline and nature of AGI itself. His posts blend technical ML concepts with philosophical rigor, examining why sudden breakthroughs might not doom us, what actually makes AI dangerous, and why even defining AGI misses the point.",
  "Oliver Habryka": "Oliver Habryka explores the hidden structures of thinking and decision-making, from the psychology of paranoia to the economics of trust. He challenges conventional wisdom about effort, delegation, and institutional design with posts that blend rationality, epistemology, and practical life advice. His writing reveals counterintuitive patterns in how we reason, work, and navigate uncertainty.",
  "Raye": "Raye explores the intersection of rational thinking and everyday life, challenging common misconceptions (like the myth that rare earths are actually rare) while offering philosophical takes on personal development. The writing blends psychology-informed life advice with a pragmatic, no-nonsense approach—perfect for readers who want to think more clearly about what matters without getting lost in theory.",
  "Rob Miles": "Rob Miles explores practical rationality and life systems, from celestial navigation to personal productivity frameworks, with a mix of philosophical rigor and everyday utility. His writing spans epistemology, self-experimentation (like Taguchi methods), and surprisingly deep dives into mundane topics—whether it's British currency design or the contents of his pockets—all aimed at helping readers think more clearly and act more effectively.",
  "Robert Mushkatblat": "Robert Mushkatblat explores the curious intersections of everyday life and deeper inquiry, from the mechanics of how colds spread to the puzzling mediocrity of American tea. His writing spans biology, economics, and society, examining both mundane mysteries and speculative questions with an eye for the overlooked details that shape our world.",
  "Ruben Bloom": "Ruben Bloom explores how we think, decide, and operate—from the counterintuitive wisdom of slow organizational growth to the precise mechanics of high-performance driving. His writing blends rationality and epistemology with practical life advice, examining how our surprisingly autonomous thoughts shape different mental realities and why asking \"what's so hard about this?\" unlocks better understanding.",
  "Sacha Witt": "Sacha Witt explores the messy intersections of personhood, ethics, and everyday life with provocative irreverence. Expect contrarian takes on self-help wisdom (why seethe instead of meditating?), philosophical deep-dives into identity and moral agency, and deeply personal reflections that range from family memories to hypothetical slave species—all delivered with sharp wit and unapologetic intensity.",
  "Sasha Putilin": "Sasha Putilin explores consciousness through radical self-experimentation—from two dozen psychedelics to speed dating as \"romantic skills training\"—while dissecting social conventions and ethical dilemmas with unflinching honesty. His writing blends chemistry knowledge, philosophical reflection, and deeply personal narratives, examining everything from meditation ethics to why you should never say \"let's stay in touch.\"",
  "Sean Carter": "Sean Carter explores the intersections of culture, technology, and society through an eclectic lens—from dissecting elite institutions and AI agency to celebrating analog writing traditions and demographic shifts. His work blends personal reflection with sharp cultural commentary, equally at home analyzing African economics, college admissions, or the hidden details in fellow writers' websites.",
  "Simon Lermen": "Simon Lermen explores the technical and societal dimensions of AI development, from machine learning security and recursive self-improvement to the political battles over datacenters and AI-generated content. His work bridges rigorous AI safety research with sharp cultural analysis, examining how artificial intelligence reshapes everything from authorship detection to economic systems like UBI in an AGI future.",
  "Skyler": "Skyler explores how we fool ourselves and each other—from group dynamics that lead everyone astray to the gap between our stated preferences and actual behavior. Blending rationality, social psychology, and epistemology, the writing examines why our control systems fail, how we navigate social games, and what it means to think clearly in a world full of contradictions.",
  "Tomás Bjartur": "Tomás Bjartur explores philosophy and rationality through an eclectic lens, tackling thought experiments like the Mere Addition Paradox alongside cultural commentary on everything from Beatles albums to fictional characters. His writing blends rigorous analysis with personal reflection, moving seamlessly between abstract philosophical puzzles, technology critique, and literary observations.",
  "Tsvi Benson-Tilsen": "Tsvi Benson-Tilsen explores the thorniest problems in AI alignment and rationality, from coordinating around complex boundaries to the challenge of graceful deference when knowledge runs out. His work weaves together technical AI safety concerns with deeper philosophical and epistemological questions, occasionally venturing into explorations of religion and metaphysics through an analytical lens.",
  "Vaniver": "Vaniver explores how to think clearly and live deliberately, mixing philosophical investigations with practical life advice. From dating notes to economic history, from fantasy fiction analysis to questions of militarism, the writing spans personal reflections, rational decision-making, and societal observations—all united by a curiosity about how to navigate the world thoughtfully and choose your own path.",
  "Vasco Queirós": "Vasco Queirós explores the intellectual battlegrounds where language, truth, and power collide. Through a lens of rigorous epistemology and political philosophy, he dissects how ideas spread, how meaning is contested, and why rational discourse increasingly gives way to adversarial conflict in modern society. His work blends memetics, semantics, and strategic thinking to map our ideological warfare.",
  "Vishal Prasad": "Vishal Prasad explores the craft of writing and thinking clearly, from dissecting prose style to unpacking philosophical concepts like Dennett's \"Real Patterns.\" He moves fluidly between literary analysis (Thomas Cromwell's domesticity in *Wolf Hall*), intellectual skepticism (challenging the bargaining theory of war), and practical life advice—including why nearly everyone should take creatine.",
  "William Friedman": "William Friedman explores how civilizations rise, fall, and resist entropy through the lens of history and strategic thinking. From Byzantine empire-building to medieval power struggles, he examines the forces that drive historical change and the exceptional individuals who fight against equilibrium. His work blends historical analysis with rationalist philosophy to understand politics, warfare, and societal transformation.",
  "Ozy Brennan": "Ozy Brennan explores the intersection of biology, society, and speculative fiction through thoughtful reviews and analysis. Their work examines how scientific concepts and dystopian narratives reflect and shape our understanding of contemporary social issues, blending rigorous intellectual engagement with accessibility.",
  "Raymond Arnold": "Raymond Arnold explores the intersection of human behavior and emerging technology, from dissecting what makes songs singable (hint: it's about attitude) to examining AI's rapidly advancing capabilities. His writing spans cognitive patterns, musical accessibility, and existential tech risks, blending practical observations about how we think and interact with deeper questions about where technology is taking us."
}
